app/views/articles/show.html.erb

                    <small>
                        <%= pluralize(@article.user.articles.count, "article") if @article.user.articles %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 2]]