app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
    def index
        @articles = Article.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asfdsds"], ["description", "fdfdsfsdfdsfdf"], ["created_at", "2018-03-23 22:28:16.422362"], ["updated_at", "2018-03-23 22:28:16.422362"]]
---
    def create
        #debugger
        @article = Article.new(article_params)

        #Hardcode Temporario
        @article.user = User.first();
        if @article.save

UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "fdfdsfsdfdsfdf22"], ["updated_at", "2018-03-23 22:28:20.782596"], ["id", 1]]
---
    def update
        if @article.update(article_params)