app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(user_params)

        if @user.save

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]
---
    def show
        @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)

UPDATE "users" SET "username" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "tonnn3"], ["email", "tonzera3@gmail.com"], ["updated_at", "2018-03-31 16:22:43.898149"], ["id", 7]]
---
    def update
        if @user.update(user_params)